*comment added by Github workflow: "Terraform"*

#### 🖌 Terraform Format and Style 🟢 `success`

#### ⚙️ Terraform Initialization 🟢 `success`

#### 🤖 Terraform Validation 🟢 `success`

#### 📖 Terraform Plan 🟢 `success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/a-mt/test-terraform-cloud-prod/runs/run-utwRPh1S8RYFvn4S

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.website will be created
  + resource "google_storage_bucket" "website" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "test-terraform-cloud-static-website"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.static_site_index will be created
  + resource "google_storage_bucket_object" "static_site_index" {
      + bucket         = "test-terraform-cloud-static-website"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "index.html"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "assets/index.html"
      + storage_class  = (known after apply)
    }

  # google_storage_object_access_control.public_index_rule will be created
  + resource "google_storage_object_access_control" "public_index_rule" {
      + bucket       = "test-terraform-cloud-static-website"
      + domain       = (known after apply)
      + email        = (known after apply)
      + entity       = "allUsers"
      + entity_id    = (known after apply)
      + generation   = (known after apply)
      + id           = (known after apply)
      + object       = "index.html"
      + project_team = (known after apply)
      + role         = "READER"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gcp_index_url = (known after apply)

```

</details>

---

Pull request #4 from @a-mt / dev to prod
Executed plan in: test-terraform-cloud-prod